{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[SOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          3
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[SOS]": {
        "id": "[SOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[SOS]"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "##"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "##",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "?": 29,
      "a": 30,
      "b": 31,
      "c": 32,
      "d": 33,
      "e": 34,
      "f": 35,
      "g": 36,
      "h": 37,
      "i": 38,
      "j": 39,
      "k": 40,
      "l": 41,
      "m": 42,
      "n": 43,
      "o": 44,
      "p": 45,
      "q": 46,
      "r": 47,
      "s": 48,
      "t": 49,
      "u": 50,
      "v": 51,
      "w": 52,
      "x": 53,
      "y": 54,
      "z": 55,
      "s##": 56,
      "e##": 57,
      "9##": 58,
      "t##": 59,
      "d##": 60,
      "g##": 61,
      "n##": 62,
      "y##": 63,
      "o##": 64,
      "h##": 65,
      "0##": 66,
      "r##": 67,
      "l##": 68,
      "i##": 69,
      "'##": 70,
      "k##": 71,
      "a##": 72,
      "6##": 73,
      "w##": 74,
      "m##": 75,
      "f##": 76,
      "u##": 77,
      "x##": 78,
      "4##": 79,
      "c##": 80,
      "p##": 81,
      "!##": 82,
      "\"##": 83,
      "7##": 84,
      ",##": 85,
      ";##": 86,
      "2##": 87,
      "b##": 88,
      "8##": 89,
      "1##": 90,
      "5##": 91,
      "v##": 92,
      "*##": 93,
      "+##": 94,
      ")##": 95,
      "?##": 96,
      "3##": 97,
      "/##": 98,
      "###": 99,
      "(##": 100,
      "&##": 101,
      ".##": 102,
      "-##": 103,
      "z##": 104,
      ":##": 105,
      "j##": 106,
      "th": 107,
      "the##": 108,
      "in": 109,
      "an": 110,
      "er": 111,
      "ed##": 112,
      "en": 113,
      "ar": 114,
      "of##": 115,
      "ou": 116,
      "re": 117,
      "ti": 118,
      "er##": 119,
      "on": 120,
      "to##": 121,
      "and##": 122,
      "in##": 123,
      "ing##": 124,
      "is##": 125,
      "on##": 126,
      "or": 127,
      "it": 128,
      "ha": 129,
      "st": 130,
      "al": 131,
      "at##": 132,
      "es##": 133,
      "ro": 134,
      "as##": 135,
      "ic": 136,
      "el": 137,
      "en##": 138,
      "an##": 139,
      "il": 140,
      "at": 141,
      "or##": 142,
      "wh": 143,
      "es": 144,
      "ac": 145,
      "om": 146,
      "is": 147,
      "as": 148,
      "that##": 149,
      "ly##": 150,
      "he##": 151,
      "be": 152,
      "no": 153,
      "al##": 154,
      "it##": 155,
      "ent##": 156,
      "ve##": 157,
      "ol": 158,
      "si": 159,
      "ri": 160,
      "was##": 161,
      "ur": 162,
      "pl": 163,
      "ch": 164,
      "the": 165,
      "tion##": 166,
      "un": 167,
      "for##": 168,
      "ev": 169,
      "ec": 170,
      "ad": 171,
      "ab": 172,
      "ay##": 173,
      "us": 174,
      "em": 175,
      "ith##": 176,
      "ere##": 177,
      "li": 178,
      "be##": 179,
      "with##": 180,
      "am": 181,
      "bu": 182,
      "le##": 183,
      "os": 184,
      "su": 185,
      "gh": 186,
      "com": 187,
      "di": 188,
      "ag": 189,
      "ce##": 190,
      "ne": 191,
      "le": 192,
      "by##": 193,
      "had##": 194,
      "con": 195,
      "his##": 196,
      "not##": 197,
      "ow": 198,
      "but##": 199,
      "ent": 200,
      "ir": 201,
      "go": 202,
      "ar##": 203,
      "mr##": 204,
      "this##": 205,
      "ld##": 206,
      "oun": 207,
      "pe": 208,
      "are##": 209,
      "pro": 210,
      "se": 211,
      "ich##": 212,
      "which##": 213,
      "de": 214,
      "ver": 215,
      "ap": 216,
      "ould##": 217,
      "ati": 218,
      "sh": 219,
      "ers##": 220,
      "ex": 221,
      "tr": 222,
      "ther##": 223,
      "one##": 224,
      "ff": 225,
      "per": 226,
      "pre": 227,
      "ation##": 228,
      "have##": 229,
      "par": 230,
      "our##": 231,
      "ght##": 232,
      "for": 233,
      "oo": 234,
      "ul": 235,
      "et##": 236,
      "ch##": 237,
      "fro": 238,
      "out##": 239,
      "ons##": 240,
      "has##": 241,
      "ir##": 242,
      "op": 243,
      "qu": 244,
      "from##": 245,
      "they##": 246,
      "th##": 247,
      "ter##": 248,
      "ted##": 249,
      "wil": 250,
      "all##": 251,
      "me##": 252,
      "ear": 253,
      "ma": 254,
      "st##": 255
    },
    "merges": [
      "t h",
      "th e##",
      "i n",
      "a n",
      "e r",
      "e d##",
      "e n",
      "a r",
      "o f##",
      "o u",
      "r e",
      "t i",
      "e r##",
      "o n",
      "t o##",
      "an d##",
      "i n##",
      "in g##",
      "i s##",
      "o n##",
      "o r",
      "i t",
      "h a",
      "s t",
      "a l",
      "a t##",
      "e s##",
      "r o",
      "a s##",
      "i c",
      "e l",
      "e n##",
      "a n##",
      "i l",
      "a t",
      "o r##",
      "w h",
      "e s",
      "a c",
      "o m",
      "i s",
      "a s",
      "th at##",
      "l y##",
      "h e##",
      "b e",
      "n o",
      "a l##",
      "i t##",
      "en t##",
      "v e##",
      "o l",
      "s i",
      "r i",
      "w as##",
      "u r",
      "p l",
      "c h",
      "th e",
      "ti on##",
      "u n",
      "f or##",
      "e v",
      "e c",
      "a d",
      "a b",
      "a y##",
      "u s",
      "e m",
      "it h##",
      "er e##",
      "l i",
      "b e##",
      "w ith##",
      "a m",
      "b u",
      "l e##",
      "o s",
      "s u",
      "g h",
      "c om",
      "d i",
      "a g",
      "c e##",
      "n e",
      "l e",
      "b y##",
      "ha d##",
      "c on",
      "h is##",
      "no t##",
      "o w",
      "bu t##",
      "en t",
      "i r",
      "g o",
      "a r##",
      "m r##",
      "th is##",
      "l d##",
      "ou n",
      "p e",
      "ar e##",
      "p ro",
      "s e",
      "ic h##",
      "wh ich##",
      "d e",
      "v er",
      "a p",
      "ou ld##",
      "a ti",
      "s h",
      "er s##",
      "e x",
      "t r",
      "th er##",
      "on e##",
      "f f",
      "p er",
      "p re",
      "a tion##",
      "ha ve##",
      "p ar",
      "ou r##",
      "gh t##",
      "f or",
      "o o",
      "u l",
      "e t##",
      "c h##",
      "f ro",
      "ou t##",
      "on s##",
      "ha s##",
      "i r##",
      "o p",
      "q u",
      "fro m##",
      "the y##",
      "t h##",
      "t er##",
      "t ed##",
      "w il",
      "al l##",
      "m e##",
      "e ar",
      "m a",
      "s t##"
    ]
  }
}