{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "always"
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "always"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<unk>": 0,
      "\b": 1,
      "\t": 2,
      "\n": 3,
      "\r": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "£": 100,
      "¥": 101,
      "°": 102,
      "¿": 103,
      "É": 104,
      "Ö": 105,
      "á": 106,
      "ã": 107,
      "ä": 108,
      "ç": 109,
      "è": 110,
      "é": 111,
      "ë": 112,
      "í": 113,
      "î": 114,
      "ñ": 115,
      "ó": 116,
      "ô": 117,
      "ö": 118,
      "÷": 119,
      "ø": 120,
      "ú": 121,
      "ü": 122,
      "ǎ": 123,
      "ǐ": 124,
      "̈": 125,
      "α": 126,
      "θ": 127,
      "μ": 128,
      "π": 129,
      "ψ": 130,
      "П": 131,
      "а": 132,
      "в": 133,
      "д": 134,
      "е": 135,
      "и": 136,
      "к": 137,
      "л": 138,
      "м": 139,
      "р": 140,
      "т": 141,
      "،": 142,
      "؟": 143,
      "ا": 144,
      "ب": 145,
      "ح": 146,
      "ر": 147,
      "ف": 148,
      "ك": 149,
      "ل": 150,
      "م": 151,
      "ي": 152,
      "​": 153,
      "‌": 154,
      "–": 155,
      "—": 156,
      "‘": 157,
      "’": 158,
      "€": 159,
      "₹": 160,
      "√": 161,
      "▁": 162,
      "☀": 163,
      "☕": 164,
      "⟩": 165,
      "、": 166,
      "。": 167,
      "お": 168,
      "か": 169,
      "こ": 170,
      "す": 171,
      "ち": 172,
      "で": 173,
      "に": 174,
      "の": 175,
      "は": 176,
      "を": 177,
      "ん": 178,
      "上": 179,
      "下": 180,
      "不": 181,
      "个": 182,
      "中": 183,
      "串": 184,
      "主": 185,
      "了": 186,
      "事": 187,
      "于": 188,
      "些": 189,
      "产": 190,
      "以": 191,
      "你": 192,
      "例": 193,
      "供": 194,
      "保": 195,
      "值": 196,
      "元": 197,
      "充": 198,
      "入": 199,
      "全": 200,
      "其": 201,
      "具": 202,
      "函": 203,
      "划": 204,
      "列": 205,
      "前": 206,
      "功": 207,
      "加": 208,
      "包": 209,
      "单": 210,
      "句": 211,
      "可": 212,
      "合": 213,
      "同": 214,
      "含": 215,
      "和": 216,
      "品": 217,
      "在": 218,
      "地": 219,
      "填": 220,
      "增": 221,
      "复": 222,
      "多": 223,
      "好": 224,
      "字": 225,
      "宣": 226,
      "将": 227,
      "序": 228,
      "应": 229,
      "式": 230,
      "性": 231,
      "成": 232,
      "据": 233,
      "描": 234,
      "提": 235,
      "插": 236,
      "数": 237,
      "文": 238,
      "日": 239,
      "明": 240,
      "更": 241,
      "有": 242,
      "期": 243,
      "本": 244,
      "机": 245,
      "杂": 246,
      "条": 247,
      "构": 248,
      "样": 249,
      "格": 250,
      "每": 251,
      "気": 252,
      "法": 253,
      "测": 254,
      "涵": 255,
      "生": 256,
      "用": 257,
      "的": 258,
      "盖": 259,
      "目": 260,
      "确": 261,
      "示": 262,
      "空": 263,
      "符": 264,
      "約": 265,
      "组": 266,
      "结": 267,
      "能": 268,
      "行": 269,
      "表": 270,
      "要": 271,
      "言": 272,
      "語": 273,
      "説": 274,
      "计": 275,
      "订": 276,
      "试": 277,
      "语": 278,
      "购": 279,
      "这": 280,
      "进": 281,
      "述": 282,
      "都": 283,
      "键": 284,
      "非": 285,
      "面": 286,
      "顺": 287,
      "风": 288,
      "️": 289,
      "�": 290,
      "🍕": 291,
      "🎉": 292,
      "💪": 293,
      "🔥": 294,
      "😀": 295,
      "😉": 296,
      "😊": 297,
      "😞": 298,
      "🙏": 299,
      ",\n": 300,
      "AR": 301,
      "TA": 302,
      "TE": 303,
      "NT": 304,
      "▁I": 305,
      "RE": 306,
      "LE": 307,
      "▁INT": 308,
      "ATE": 309,
      "BLE": 310,
      "▁TA": 311,
      "▁TABLE": 312,
      "▁(": 313,
      "##": 314,
      "IM": 315,
      "▁V": 316,
      "▁K": 317,
      "▁N": 318,
      "CH": 319,
      "CHAR": 320,
      "▁VAR": 321,
      "▁VARCHAR": 322,
      "EY": 323,
      ");": 324,
      "▁KEY": 325,
      "▁VARCHAR(": 326,
      "\n);": 327,
      "CRE": 328,
      "CREATE": 329,
      "▁(\n": 330,
      "▁P": 331,
      "▁PR": 332,
      "ARY": 333,
      "▁PRIM": 334,
      "▁PRIMARY": 335,
      "),\n": 336,
      "▁S": 337,
      "▁D": 338,
      "▁KEY,\n": 339,
      "▁##": 340,
      "▁###": 341,
      "\n\n": 342,
      "\n);\n\n": 343,
      "\n);\n\nCREATE": 344,
      "ES": 345,
      "UL": 346,
      "OT": 347,
      "▁NOT": 348,
      "ULL": 349,
      "▁NULL": 350,
      "▁_": 351,
      "50": 352,
      "▁INT,\n": 353,
      "AL": 354,
      "▁VARCHAR(50": 355,
      "▁NULL,\n": 356,
      "10": 357,
      "▁VARCHAR(2": 358,
      "▁U": 359,
      "ERE": 360,
      "▁F": 361,
      "ME": 362,
      "__": 363,
      "▁T": 364,
      "DA": 365,
      "55": 366,
      "MENT": 367,
      "▁STA": 368,
      "DATA": 369,
      "TEMENT": 370,
      "▁STATEMENT": 371,
      "▁TABLEDATA": 372,
      "▁CREATE": 373,
      "XT": 374,
      "▁'": 375,
      "▁VARCHAR(255": 376,
      "▁DATE": 377,
      "▁TE": 378,
      "▁TEXT": 379,
      "ER": 380,
      "NC": 381,
      "▁DE": 382,
      "▁W": 383,
      "▁VARCHAR(50),\n": 384,
      "ID": 385,
      "▁DATE,\n": 386,
      "▁UU": 387,
      "▁UUID": 388,
      "▁RE": 389,
      "▁TEXT,\n": 390,
      "▁REF": 391,
      "NCES": 392,
      "ERENCES": 393,
      "▁REFERENCES": 394,
      "MP": 395,
      "▁TIM": 396,
      "',": 397,
      "▁2": 398,
      "CIM": 399,
      "▁DECIM": 400,
      "▁DECIMAL": 401,
      "▁VARCHAR(10": 402,
      "ESTA": 403,
      "ESTAMP": 404,
      "▁TIMESTAMP": 405,
      "▁B": 406,
      "▁VARCHAR(50)": 407,
      "▁VARCHAR(255),\n": 408,
      "▁=": 409,
      "RO": 410,
      "▁1": 411,
      "▁VARCHAR(100": 412,
      "▁KEY\n);\n\nCREATE": 413,
      "▁WH": 414,
      "▁A": 415,
      "▁WHERE": 416,
      "▁SE": 417,
      "ROM": 418,
      "▁FROM": 419,
      "▁O": 420,
      "▁VARCHAR(255)": 421,
      "▁IN": 422,
      "00": 423,
      "▁J": 424,
      "CT": 425,
      "▁TIMESTAMP,\n": 426,
      "▁3": 427,
      "LO": 428,
      "▁t": 429,
      "AT": 430,
      "▁DECIMAL(": 431,
      "▁0": 432,
      "▁C": 433,
      "20": 434,
      "▁f": 435,
      "▁a": 436,
      "IAL": 437,
      "▁5": 438,
      "ERIAL": 439,
      "▁SERIAL": 440,
      "▁p": 441,
      "▁s": 442,
      "LECT": 443,
      "▁c": 444,
      "ERT": 445,
      "SERT": 446,
      "▁INSERT": 447,
      "▁SELECT": 448,
      "▁INTO": 449,
      "ALU": 450,
      "ALUES": 451,
      "▁VALUES": 452,
      "▁4": 453,
      "▁L": 454,
      "▁G": 455,
      "▁i": 456,
      "-0": 457,
      "▁d": 458,
      "▁r": 459,
      "▁FLO": 460,
      "▁FLOAT": 461,
      "▁e": 462,
      "▁8": 463,
      "▁7": 464,
      "▁m": 465,
      "▁E": 466,
      "▁o": 467,
      "▁6": 468,
      "▁u": 469,
      "▁Y": 470,
      "▁M": 471,
      "▁w": 472,
      "▁l": 473,
      "▁n": 474,
      "▁H": 475,
      "▁9": 476,
      "▁b": 477,
      "▁v": 478,
      "▁h": 479,
      "▁g": 480,
      "▁R": 481,
      "▁y": 482,
      "▁q": 483,
      "▁k": 484,
      "▁j": 485,
      "▁x": 486,
      "▁Q": 487,
      "▁z": 488,
      "▁X": 489,
      "▁Z": 490,
      "10,": 491,
      "▁DECIMAL(10,": 492,
      "▁VARCHAR(100),\n": 493,
      "▁INT\n);\n\nCREATE": 494,
      "22": 495,
      "▁NULL\n);\n\nCREATE": 496,
      "▁VARCHAR(100)": 497,
      "▁'20": 498,
      "▁KEY\n);": 499,
      "k_": 500,
      "l_": 501,
      "e_": 502,
      "▁FLOAT,\n": 503,
      "n_": 504,
      "t_": 505,
      "r_": 506,
      "g_": 507
    },
    "merges": [
      ", \n",
      "A R",
      "T A",
      "T E",
      "N T",
      "▁ I",
      "R E",
      "L E",
      "▁I NT",
      "A TE",
      "B LE",
      "▁ TA",
      "▁TA BLE",
      "▁ (",
      "# #",
      "I M",
      "▁ V",
      "▁ K",
      "▁ N",
      "C H",
      "CH AR",
      "▁V AR",
      "▁VAR CHAR",
      "E Y",
      ") ;",
      "▁K EY",
      "▁VARCHAR (",
      "\n );",
      "C RE",
      "CRE ATE",
      "▁( \n",
      "▁ P",
      "▁P R",
      "AR Y",
      "▁PR IM",
      "▁PRIM ARY",
      ") ,\n",
      "▁ S",
      "▁ D",
      "▁KEY ,\n",
      "▁ ##",
      "▁## #",
      "\n \n",
      "\n); \n\n",
      "\n);\n\n CREATE",
      "E S",
      "U L",
      "O T",
      "▁N OT",
      "UL L",
      "▁N ULL",
      "▁ _",
      "5 0",
      "▁INT ,\n",
      "A L",
      "▁VARCHAR( 50",
      "▁NULL ,\n",
      "1 0",
      "▁VARCHAR( 2",
      "▁ U",
      "E RE",
      "▁ F",
      "M E",
      "_ _",
      "▁ T",
      "D A",
      "5 5",
      "ME NT",
      "▁S TA",
      "DA TA",
      "TE MENT",
      "▁STA TEMENT",
      "▁TABLE DATA",
      "▁ CREATE",
      "X T",
      "▁ '",
      "▁VARCHAR(2 55",
      "▁D ATE",
      "▁ TE",
      "▁TE XT",
      "E R",
      "N C",
      "▁D E",
      "▁ W",
      "▁VARCHAR(50 ),\n",
      "I D",
      "▁DATE ,\n",
      "▁U U",
      "▁UU ID",
      "▁ RE",
      "▁TEXT ,\n",
      "▁RE F",
      "NC ES",
      "ERE NCES",
      "▁REF ERENCES",
      "M P",
      "▁T IM",
      "' ,",
      "▁ 2",
      "C IM",
      "▁DE CIM",
      "▁DECIM AL",
      "▁VARCHAR( 10",
      "ES TA",
      "ESTA MP",
      "▁TIM ESTAMP",
      "▁ B",
      "▁VARCHAR(50 )",
      "▁VARCHAR(255 ),\n",
      "▁ =",
      "R O",
      "▁ 1",
      "▁VARCHAR(10 0",
      "▁KEY \n);\n\nCREATE",
      "▁W H",
      "▁ A",
      "▁WH ERE",
      "▁S E",
      "RO M",
      "▁F ROM",
      "▁ O",
      "▁VARCHAR(255 )",
      "▁I N",
      "0 0",
      "▁ J",
      "C T",
      "▁TIMESTAMP ,\n",
      "▁ 3",
      "L O",
      "▁ t",
      "A T",
      "▁DECIMAL (",
      "▁ 0",
      "▁ C",
      "2 0",
      "▁ f",
      "▁ a",
      "I AL",
      "▁ 5",
      "ER IAL",
      "▁S ERIAL",
      "▁ p",
      "▁ s",
      "LE CT",
      "▁ c",
      "ER T",
      "S ERT",
      "▁IN SERT",
      "▁SE LECT",
      "▁INT O",
      "AL U",
      "ALU ES",
      "▁V ALUES",
      "▁ 4",
      "▁ L",
      "▁ G",
      "▁ i",
      "- 0",
      "▁ d",
      "▁ r",
      "▁F LO",
      "▁FLO AT",
      "▁ e",
      "▁ 8",
      "▁ 7",
      "▁ m",
      "▁ E",
      "▁ o",
      "▁ 6",
      "▁ u",
      "▁ Y",
      "▁ M",
      "▁ w",
      "▁ l",
      "▁ n",
      "▁ H",
      "▁ 9",
      "▁ b",
      "▁ v",
      "▁ h",
      "▁ g",
      "▁ R",
      "▁ y",
      "▁ q",
      "▁ k",
      "▁ j",
      "▁ x",
      "▁ Q",
      "▁ z",
      "▁ X",
      "▁ Z",
      "10 ,",
      "▁DECIMAL( 10,",
      "▁VARCHAR(100 ),\n",
      "▁INT \n);\n\nCREATE",
      "2 2",
      "▁NULL \n);\n\nCREATE",
      "▁VARCHAR(100 )",
      "▁' 20",
      "▁KEY \n);",
      "k _",
      "l _",
      "e _",
      "▁FLOAT ,\n",
      "n _",
      "t _",
      "r _",
      "g _"
    ]
  }
}